[metadata]
creation_date = "2026/07/06"
updated_date = "2026/07/07"

[rule]
author = ["FardeenI"]
description = "This rule aims to detect password spray attempts by firing if several failed network authentication attempts across multiple usernames occur within a short interval."
name = "[Detection Engineering Project] Password Spray"
tags = ["[Detection Engineering Project]"]
risk_score = 47
severity = "medium"
type = "threshold"
rule_id = "7184bf51-315a-495b-b4e1-d6b9aff9388f"
index = ["winlogbeat-*"]
from = "now-35m"
interval = "5m"
max_signals = 100
enabled = true

query = '''
event.code : "4625" and winlog.logon.type : "Network"
'''

[rule.threshold]
field = ["source.ip"]
value = 3

[[rule.threshold.cardinality]]
field = "winlog.event_data.TargetUserName"
value = 2

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"

[[rule.threat.technique.subtechnique]]
id = "T1110.003"
name = "Password Spraying"
reference = "https://attack.mitre.org/techniques/T1110/003/"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
